MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC54102J256BD64/mcu.h
/*
** ###################################################################
**     Processors:          LPC54102J256BD64_cm0plus
**                          LPC54102J256UK49_cm0plus
**                          LPC54102J512BD64_cm0plus
**                          LPC54102J512UK49_cm0plus
**
**     Compilers:           IAR ANSI C/C++ Compiler for ARM
**                          Keil ARM C/C++ Compiler
**                          MCUXpresso Compiler
**
**     Reference manual:    LPC5410x User manual Rev. 2.4 25 May 2016
**     Version:             rev. 1.0, 2016-04-29
**     Build:               b190723
**
**     Abstract:
**         CMSIS Peripheral Access Layer for LPC54102_cm0plus
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2019 NXP
**     All rights reserved.
**
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2016-04-29)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file LPC54102_cm0plus.h
 * @version 1.0
 * @date 2016-04-29
 * @brief CMSIS Peripheral Access Layer for LPC54102_cm0plus
 *
 * CMSIS Peripheral Access Layer for LPC54102_cm0plus
 */

#ifndef _LPC54102_CM0PLUS_H_
#define _LPC54102_CM0PLUS_H_                     /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0100U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 48                 /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  HardFault_IRQn               = -13,              /**< Cortex-M0 SV Hard Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M0 SV Call Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M0 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M0 System Tick Interrupt */

  /* Device specific interrupts */
  WDT_IRQn                     = 0,                /**< Windowed watchdog timer, Brownout detect */
  BOD_IRQn                     = 1,                /**< BOD interrupt */
  Reserved18_IRQn              = 2,                /**< Reserved interrupt */
  DMA0_IRQn                    = 3,                /**< DMA controller */
  GINT0_IRQn                   = 4,                /**< GPIO group 0 */
  PIN_INT0_IRQn                = 5,                /**< Pin interrupt 0 or pattern match engine slice 0 */
  PIN_INT1_IRQn                = 6,                /**< Pin interrupt 1or pattern match engine slice 1 */
  PIN_INT2_IRQn                = 7,                /**< Pin interrupt 2 or pattern match engine slice 2 */
  PIN_INT3_IRQn                = 8,                /**< Pin interrupt 3 or pattern match engine slice 3 */
  UTICK0_IRQn                  = 9,                /**< Micro-tick Timer */
  MRT0_IRQn                    = 10,               /**< Multi-rate timer */
  CTIMER0_IRQn                 = 11,               /**< Standard counter/timer CTIMER0 */
  CTIMER1_IRQn                 = 12,               /**< Standard counter/timer CTIMER1 */
  CTIMER2_IRQn                 = 13,               /**< Standard counter/timer CTIMER2 */
  CTIMER3_IRQn                 = 14,               /**< Standard counter/timer CTIMER3 */
  CTIMER4_IRQn                 = 15,               /**< Standard counter/timer CTIMER4 */
  SCT0_IRQn                    = 16,               /**< SCTimer/PWM */
  USART0_IRQn                  = 17,               /**< USART0 */
  USART1_IRQn                  = 18,               /**< USART1 */
  USART2_IRQn                  = 19,               /**< USART2 */
  USART3_IRQn                  = 20,               /**< USART3 */
  I2C0_IRQn                    = 21,               /**< I2C0 */
  I2C1_IRQn                    = 22,               /**< I2C1 */
  I2C2_IRQn                    = 23,               /**< I2C2 */
  SPI0_IRQn                    = 24,               /**< SPI0 */
  SPI1_IRQn                    = 25,               /**< SPI1 */
  ADC0_SEQA_IRQn               = 26,               /**< ADC0 sequence A completion. */
  ADC0_SEQB_IRQn               = 27,               /**< ADC0 sequence B completion. */
  ADC0_THCMP_IRQn              = 28,               /**< ADC0 threshold compare and error. */
  RTC_IRQn                     = 29,               /**< RTC alarm and wake-up interrupts */
  Reserved46_IRQn              = 30,               /**< Reserved interrupt */
  MAILBOX_IRQn                 = 31                /**< Mailbox interrupt (present on selected devices) */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M0 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M0 Core Configuration
 * @{
 */

#define __CM0PLUS_REV                  0x0000    /**< Core revision r0p0 */
#define __MPU_PRESENT                  0         /**< Defines if an MPU is present or not */
#define __VTOR_PRESENT                 1         /**< Defines if VTOR is present or not */
#define __NVIC_PRIO_BITS               2         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */

#define __SOFTFP__ // Note: Added for MikroE implementation.
#include "core_cm0plus.h"              /* Core Peripheral Access Layer */
// Note: Changed for MikroE implementation.
//#include "system_LPC54102_cm0plus.h"   /* Device specific configuration file */
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.
#include <stdint.h>

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
/*!
 * @addtogroup dma_request
 * @{
 */

