MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC54102J256BD64/mcu.h
/*! @name FIFOUPDATESPI - SPI FIFO global update register */
/*! @{ */
#define VFIFO_FIFOUPDATESPI_SPI0RXUPDATESIZE_MASK (0x1U)
#define VFIFO_FIFOUPDATESPI_SPI0RXUPDATESIZE_SHIFT (0U)
#define VFIFO_FIFOUPDATESPI_SPI0RXUPDATESIZE(x)  (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATESPI_SPI0RXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATESPI_SPI0RXUPDATESIZE_MASK)
#define VFIFO_FIFOUPDATESPI_SPI1RXUPDATESIZE_MASK (0x2U)
#define VFIFO_FIFOUPDATESPI_SPI1RXUPDATESIZE_SHIFT (1U)
#define VFIFO_FIFOUPDATESPI_SPI1RXUPDATESIZE(x)  (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATESPI_SPI1RXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATESPI_SPI1RXUPDATESIZE_MASK)
#define VFIFO_FIFOUPDATESPI_SPI0TXUPDATESIZE_MASK (0x10000U)
#define VFIFO_FIFOUPDATESPI_SPI0TXUPDATESIZE_SHIFT (16U)
#define VFIFO_FIFOUPDATESPI_SPI0TXUPDATESIZE(x)  (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATESPI_SPI0TXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATESPI_SPI0TXUPDATESIZE_MASK)
#define VFIFO_FIFOUPDATESPI_SPI1TXUPDATESIZE_MASK (0x20000U)
#define VFIFO_FIFOUPDATESPI_SPI1TXUPDATESIZE_SHIFT (17U)
#define VFIFO_FIFOUPDATESPI_SPI1TXUPDATESIZE(x)  (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOUPDATESPI_SPI1TXUPDATESIZE_SHIFT)) & VFIFO_FIFOUPDATESPI_SPI1TXUPDATESIZE_MASK)
/*! @} */

/*! @name FIFOCFGSPI - FIFO configuration register for SPI0 */
/*! @{ */
#define VFIFO_FIFOCFGSPI_RXSIZE_MASK             (0xFFU)
#define VFIFO_FIFOCFGSPI_RXSIZE_SHIFT            (0U)
#define VFIFO_FIFOCFGSPI_RXSIZE(x)               (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCFGSPI_RXSIZE_SHIFT)) & VFIFO_FIFOCFGSPI_RXSIZE_MASK)
#define VFIFO_FIFOCFGSPI_TXSIZE_MASK             (0xFF00U)
#define VFIFO_FIFOCFGSPI_TXSIZE_SHIFT            (8U)
#define VFIFO_FIFOCFGSPI_TXSIZE(x)               (((uint32_t)(((uint32_t)(x)) << VFIFO_FIFOCFGSPI_TXSIZE_SHIFT)) & VFIFO_FIFOCFGSPI_TXSIZE_MASK)
/*! @} */

/* The count of VFIFO_FIFOCFGSPI */
#define VFIFO_FIFOCFGSPI_COUNT                   (2U)

/*! @name USART_CFGUSART - USART0 configuration */
/*! @{ */
#define VFIFO_USART_CFGUSART_TIMEOUTCONTONWRITE_MASK (0x10U)
#define VFIFO_USART_CFGUSART_TIMEOUTCONTONWRITE_SHIFT (4U)
#define VFIFO_USART_CFGUSART_TIMEOUTCONTONWRITE(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CFGUSART_TIMEOUTCONTONWRITE_SHIFT)) & VFIFO_USART_CFGUSART_TIMEOUTCONTONWRITE_MASK)
#define VFIFO_USART_CFGUSART_TIMEOUTCONTONEMPTY_MASK (0x20U)
#define VFIFO_USART_CFGUSART_TIMEOUTCONTONEMPTY_SHIFT (5U)
#define VFIFO_USART_CFGUSART_TIMEOUTCONTONEMPTY(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CFGUSART_TIMEOUTCONTONEMPTY_SHIFT)) & VFIFO_USART_CFGUSART_TIMEOUTCONTONEMPTY_MASK)
#define VFIFO_USART_CFGUSART_TIMEOUTBASE_MASK    (0xF00U)
#define VFIFO_USART_CFGUSART_TIMEOUTBASE_SHIFT   (8U)
#define VFIFO_USART_CFGUSART_TIMEOUTBASE(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CFGUSART_TIMEOUTBASE_SHIFT)) & VFIFO_USART_CFGUSART_TIMEOUTBASE_MASK)
#define VFIFO_USART_CFGUSART_TIMEOUTVALUE_MASK   (0xF000U)
#define VFIFO_USART_CFGUSART_TIMEOUTVALUE_SHIFT  (12U)
#define VFIFO_USART_CFGUSART_TIMEOUTVALUE(x)     (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CFGUSART_TIMEOUTVALUE_SHIFT)) & VFIFO_USART_CFGUSART_TIMEOUTVALUE_MASK)
#define VFIFO_USART_CFGUSART_RXTHRESHOLD_MASK    (0xFF0000U)
#define VFIFO_USART_CFGUSART_RXTHRESHOLD_SHIFT   (16U)
#define VFIFO_USART_CFGUSART_RXTHRESHOLD(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CFGUSART_RXTHRESHOLD_SHIFT)) & VFIFO_USART_CFGUSART_RXTHRESHOLD_MASK)
#define VFIFO_USART_CFGUSART_TXTHRESHOLD_MASK    (0xFF000000U)
#define VFIFO_USART_CFGUSART_TXTHRESHOLD_SHIFT   (24U)
#define VFIFO_USART_CFGUSART_TXTHRESHOLD(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CFGUSART_TXTHRESHOLD_SHIFT)) & VFIFO_USART_CFGUSART_TXTHRESHOLD_MASK)
/*! @} */

/* The count of VFIFO_USART_CFGUSART */
#define VFIFO_USART_CFGUSART_COUNT               (4U)

/*! @name USART_STATUSART - USART0 status */
/*! @{ */
#define VFIFO_USART_STATUSART_RXTH_MASK          (0x1U)
#define VFIFO_USART_STATUSART_RXTH_SHIFT         (0U)
#define VFIFO_USART_STATUSART_RXTH(x)            (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_RXTH_SHIFT)) & VFIFO_USART_STATUSART_RXTH_MASK)
#define VFIFO_USART_STATUSART_TXTH_MASK          (0x2U)
#define VFIFO_USART_STATUSART_TXTH_SHIFT         (1U)
#define VFIFO_USART_STATUSART_TXTH(x)            (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_TXTH_SHIFT)) & VFIFO_USART_STATUSART_TXTH_MASK)
#define VFIFO_USART_STATUSART_RXTIMEOUT_MASK     (0x10U)
#define VFIFO_USART_STATUSART_RXTIMEOUT_SHIFT    (4U)
#define VFIFO_USART_STATUSART_RXTIMEOUT(x)       (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_RXTIMEOUT_SHIFT)) & VFIFO_USART_STATUSART_RXTIMEOUT_MASK)
#define VFIFO_USART_STATUSART_BUSERR_MASK        (0x80U)
#define VFIFO_USART_STATUSART_BUSERR_SHIFT       (7U)
#define VFIFO_USART_STATUSART_BUSERR(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_BUSERR_SHIFT)) & VFIFO_USART_STATUSART_BUSERR_MASK)
#define VFIFO_USART_STATUSART_RXEMPTY_MASK       (0x100U)
#define VFIFO_USART_STATUSART_RXEMPTY_SHIFT      (8U)
#define VFIFO_USART_STATUSART_RXEMPTY(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_RXEMPTY_SHIFT)) & VFIFO_USART_STATUSART_RXEMPTY_MASK)
#define VFIFO_USART_STATUSART_TXEMPTY_MASK       (0x200U)
#define VFIFO_USART_STATUSART_TXEMPTY_SHIFT      (9U)
#define VFIFO_USART_STATUSART_TXEMPTY(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_TXEMPTY_SHIFT)) & VFIFO_USART_STATUSART_TXEMPTY_MASK)
#define VFIFO_USART_STATUSART_RXCOUNT_MASK       (0xFF0000U)
#define VFIFO_USART_STATUSART_RXCOUNT_SHIFT      (16U)
#define VFIFO_USART_STATUSART_RXCOUNT(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_RXCOUNT_SHIFT)) & VFIFO_USART_STATUSART_RXCOUNT_MASK)
#define VFIFO_USART_STATUSART_TXCOUNT_MASK       (0xFF000000U)
#define VFIFO_USART_STATUSART_TXCOUNT_SHIFT      (24U)
#define VFIFO_USART_STATUSART_TXCOUNT(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_STATUSART_TXCOUNT_SHIFT)) & VFIFO_USART_STATUSART_TXCOUNT_MASK)
/*! @} */

/* The count of VFIFO_USART_STATUSART */
#define VFIFO_USART_STATUSART_COUNT              (4U)

