MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC54102J256BD64/mcu.h
/* The count of VFIFO_USART_RXDATUSART */
#define VFIFO_USART_RXDATUSART_COUNT             (4U)

/*! @name USART_RXDATSTATUSART - USART0 received data with status */
/*! @{ */
#define VFIFO_USART_RXDATSTATUSART_RXDAT_MASK    (0x1FFU)
#define VFIFO_USART_RXDATSTATUSART_RXDAT_SHIFT   (0U)
#define VFIFO_USART_RXDATSTATUSART_RXDAT(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_RXDATSTATUSART_RXDAT_SHIFT)) & VFIFO_USART_RXDATSTATUSART_RXDAT_MASK)
#define VFIFO_USART_RXDATSTATUSART_FRAMERR_MASK  (0x2000U)
#define VFIFO_USART_RXDATSTATUSART_FRAMERR_SHIFT (13U)
#define VFIFO_USART_RXDATSTATUSART_FRAMERR(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_RXDATSTATUSART_FRAMERR_SHIFT)) & VFIFO_USART_RXDATSTATUSART_FRAMERR_MASK)
#define VFIFO_USART_RXDATSTATUSART_PARITYERR_MASK (0x4000U)
#define VFIFO_USART_RXDATSTATUSART_PARITYERR_SHIFT (14U)
#define VFIFO_USART_RXDATSTATUSART_PARITYERR(x)  (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_RXDATSTATUSART_PARITYERR_SHIFT)) & VFIFO_USART_RXDATSTATUSART_PARITYERR_MASK)
#define VFIFO_USART_RXDATSTATUSART_RXNOISE_MASK  (0x8000U)
#define VFIFO_USART_RXDATSTATUSART_RXNOISE_SHIFT (15U)
#define VFIFO_USART_RXDATSTATUSART_RXNOISE(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_RXDATSTATUSART_RXNOISE_SHIFT)) & VFIFO_USART_RXDATSTATUSART_RXNOISE_MASK)
/*! @} */

/* The count of VFIFO_USART_RXDATSTATUSART */
#define VFIFO_USART_RXDATSTATUSART_COUNT         (4U)

/*! @name USART_TXDATUSART - USART0 transmit data */
/*! @{ */
#define VFIFO_USART_TXDATUSART_TXDAT_MASK        (0x1FFU)
#define VFIFO_USART_TXDATUSART_TXDAT_SHIFT       (0U)
#define VFIFO_USART_TXDATUSART_TXDAT(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_TXDATUSART_TXDAT_SHIFT)) & VFIFO_USART_TXDATUSART_TXDAT_MASK)
/*! @} */

/* The count of VFIFO_USART_TXDATUSART */
#define VFIFO_USART_TXDATUSART_COUNT             (4U)

/*! @name SPI_CFGSPI - SPI0 configuration */
/*! @{ */
#define VFIFO_SPI_CFGSPI_TIMEOUTCONTONWRITE_MASK (0x10U)
#define VFIFO_SPI_CFGSPI_TIMEOUTCONTONWRITE_SHIFT (4U)
#define VFIFO_SPI_CFGSPI_TIMEOUTCONTONWRITE(x)   (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CFGSPI_TIMEOUTCONTONWRITE_SHIFT)) & VFIFO_SPI_CFGSPI_TIMEOUTCONTONWRITE_MASK)
#define VFIFO_SPI_CFGSPI_TIMEOUTCONTONEMPTY_MASK (0x20U)
#define VFIFO_SPI_CFGSPI_TIMEOUTCONTONEMPTY_SHIFT (5U)
#define VFIFO_SPI_CFGSPI_TIMEOUTCONTONEMPTY(x)   (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CFGSPI_TIMEOUTCONTONEMPTY_SHIFT)) & VFIFO_SPI_CFGSPI_TIMEOUTCONTONEMPTY_MASK)
#define VFIFO_SPI_CFGSPI_TIMEOUTBASE_MASK        (0xF00U)
#define VFIFO_SPI_CFGSPI_TIMEOUTBASE_SHIFT       (8U)
#define VFIFO_SPI_CFGSPI_TIMEOUTBASE(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CFGSPI_TIMEOUTBASE_SHIFT)) & VFIFO_SPI_CFGSPI_TIMEOUTBASE_MASK)
#define VFIFO_SPI_CFGSPI_TIMEOUTVALUE_MASK       (0xF000U)
#define VFIFO_SPI_CFGSPI_TIMEOUTVALUE_SHIFT      (12U)
#define VFIFO_SPI_CFGSPI_TIMEOUTVALUE(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CFGSPI_TIMEOUTVALUE_SHIFT)) & VFIFO_SPI_CFGSPI_TIMEOUTVALUE_MASK)
#define VFIFO_SPI_CFGSPI_RXTHRESHOLD_MASK        (0xFF0000U)
#define VFIFO_SPI_CFGSPI_RXTHRESHOLD_SHIFT       (16U)
#define VFIFO_SPI_CFGSPI_RXTHRESHOLD(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CFGSPI_RXTHRESHOLD_SHIFT)) & VFIFO_SPI_CFGSPI_RXTHRESHOLD_MASK)
#define VFIFO_SPI_CFGSPI_TXTHRESHOLD_MASK        (0xFF000000U)
#define VFIFO_SPI_CFGSPI_TXTHRESHOLD_SHIFT       (24U)
#define VFIFO_SPI_CFGSPI_TXTHRESHOLD(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CFGSPI_TXTHRESHOLD_SHIFT)) & VFIFO_SPI_CFGSPI_TXTHRESHOLD_MASK)
/*! @} */

/* The count of VFIFO_SPI_CFGSPI */
#define VFIFO_SPI_CFGSPI_COUNT                   (2U)

/*! @name SPI_STATSPI - SPI0 status */
/*! @{ */
#define VFIFO_SPI_STATSPI_RXTH_MASK              (0x1U)
#define VFIFO_SPI_STATSPI_RXTH_SHIFT             (0U)
#define VFIFO_SPI_STATSPI_RXTH(x)                (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_RXTH_SHIFT)) & VFIFO_SPI_STATSPI_RXTH_MASK)
#define VFIFO_SPI_STATSPI_TXTH_MASK              (0x2U)
#define VFIFO_SPI_STATSPI_TXTH_SHIFT             (1U)
#define VFIFO_SPI_STATSPI_TXTH(x)                (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_TXTH_SHIFT)) & VFIFO_SPI_STATSPI_TXTH_MASK)
#define VFIFO_SPI_STATSPI_RXTIMEOUT_MASK         (0x10U)
#define VFIFO_SPI_STATSPI_RXTIMEOUT_SHIFT        (4U)
#define VFIFO_SPI_STATSPI_RXTIMEOUT(x)           (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_RXTIMEOUT_SHIFT)) & VFIFO_SPI_STATSPI_RXTIMEOUT_MASK)
#define VFIFO_SPI_STATSPI_BUSERR_MASK            (0x80U)
#define VFIFO_SPI_STATSPI_BUSERR_SHIFT           (7U)
#define VFIFO_SPI_STATSPI_BUSERR(x)              (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_BUSERR_SHIFT)) & VFIFO_SPI_STATSPI_BUSERR_MASK)
#define VFIFO_SPI_STATSPI_RXEMPTY_MASK           (0x100U)
#define VFIFO_SPI_STATSPI_RXEMPTY_SHIFT          (8U)
#define VFIFO_SPI_STATSPI_RXEMPTY(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_RXEMPTY_SHIFT)) & VFIFO_SPI_STATSPI_RXEMPTY_MASK)
#define VFIFO_SPI_STATSPI_TXEMPTY_MASK           (0x200U)
#define VFIFO_SPI_STATSPI_TXEMPTY_SHIFT          (9U)
#define VFIFO_SPI_STATSPI_TXEMPTY(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_TXEMPTY_SHIFT)) & VFIFO_SPI_STATSPI_TXEMPTY_MASK)
#define VFIFO_SPI_STATSPI_RXCOUNT_MASK           (0xFF0000U)
#define VFIFO_SPI_STATSPI_RXCOUNT_SHIFT          (16U)
#define VFIFO_SPI_STATSPI_RXCOUNT(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_RXCOUNT_SHIFT)) & VFIFO_SPI_STATSPI_RXCOUNT_MASK)
#define VFIFO_SPI_STATSPI_TXCOUNT_MASK           (0xFF000000U)
#define VFIFO_SPI_STATSPI_TXCOUNT_SHIFT          (24U)
#define VFIFO_SPI_STATSPI_TXCOUNT(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_STATSPI_TXCOUNT_SHIFT)) & VFIFO_SPI_STATSPI_TXCOUNT_MASK)
/*! @} */

/* The count of VFIFO_SPI_STATSPI */
#define VFIFO_SPI_STATSPI_COUNT                  (2U)

/*! @name SPI_INTSTATSPI - SPI0 interrupt status */
/*! @{ */
#define VFIFO_SPI_INTSTATSPI_RXTH_MASK           (0x1U)
#define VFIFO_SPI_INTSTATSPI_RXTH_SHIFT          (0U)
#define VFIFO_SPI_INTSTATSPI_RXTH(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_RXTH_SHIFT)) & VFIFO_SPI_INTSTATSPI_RXTH_MASK)
#define VFIFO_SPI_INTSTATSPI_TXTH_MASK           (0x2U)
#define VFIFO_SPI_INTSTATSPI_TXTH_SHIFT          (1U)
#define VFIFO_SPI_INTSTATSPI_TXTH(x)             (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_TXTH_SHIFT)) & VFIFO_SPI_INTSTATSPI_TXTH_MASK)
#define VFIFO_SPI_INTSTATSPI_RXTIMEOUT_MASK      (0x10U)
#define VFIFO_SPI_INTSTATSPI_RXTIMEOUT_SHIFT     (4U)
#define VFIFO_SPI_INTSTATSPI_RXTIMEOUT(x)        (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_RXTIMEOUT_SHIFT)) & VFIFO_SPI_INTSTATSPI_RXTIMEOUT_MASK)
#define VFIFO_SPI_INTSTATSPI_BUSERR_MASK         (0x80U)
#define VFIFO_SPI_INTSTATSPI_BUSERR_SHIFT        (7U)
#define VFIFO_SPI_INTSTATSPI_BUSERR(x)           (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_BUSERR_SHIFT)) & VFIFO_SPI_INTSTATSPI_BUSERR_MASK)
#define VFIFO_SPI_INTSTATSPI_RXEMPTY_MASK        (0x100U)
#define VFIFO_SPI_INTSTATSPI_RXEMPTY_SHIFT       (8U)
#define VFIFO_SPI_INTSTATSPI_RXEMPTY(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_RXEMPTY_SHIFT)) & VFIFO_SPI_INTSTATSPI_RXEMPTY_MASK)
#define VFIFO_SPI_INTSTATSPI_TXEMPTY_MASK        (0x200U)
#define VFIFO_SPI_INTSTATSPI_TXEMPTY_SHIFT       (9U)
#define VFIFO_SPI_INTSTATSPI_TXEMPTY(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_TXEMPTY_SHIFT)) & VFIFO_SPI_INTSTATSPI_TXEMPTY_MASK)
#define VFIFO_SPI_INTSTATSPI_RXCOUNT_MASK        (0xFF0000U)
#define VFIFO_SPI_INTSTATSPI_RXCOUNT_SHIFT       (16U)
#define VFIFO_SPI_INTSTATSPI_RXCOUNT(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_RXCOUNT_SHIFT)) & VFIFO_SPI_INTSTATSPI_RXCOUNT_MASK)
#define VFIFO_SPI_INTSTATSPI_TXCOUNT_MASK        (0xFF000000U)
#define VFIFO_SPI_INTSTATSPI_TXCOUNT_SHIFT       (24U)
#define VFIFO_SPI_INTSTATSPI_TXCOUNT(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_INTSTATSPI_TXCOUNT_SHIFT)) & VFIFO_SPI_INTSTATSPI_TXCOUNT_MASK)
/*! @} */

/* The count of VFIFO_SPI_INTSTATSPI */
#define VFIFO_SPI_INTSTATSPI_COUNT               (2U)

/*! @name SPI_CTLSETSPI - SPI0 control read and set register. A complete value may be read from this register. Writing a 1 to any implemented bit position causes that bit to be set. */
/*! @{ */
#define VFIFO_SPI_CTLSETSPI_RXTHINTEN_MASK       (0x1U)
#define VFIFO_SPI_CTLSETSPI_RXTHINTEN_SHIFT      (0U)
#define VFIFO_SPI_CTLSETSPI_RXTHINTEN(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLSETSPI_RXTHINTEN_SHIFT)) & VFIFO_SPI_CTLSETSPI_RXTHINTEN_MASK)
#define VFIFO_SPI_CTLSETSPI_TXTHINTEN_MASK       (0x2U)
#define VFIFO_SPI_CTLSETSPI_TXTHINTEN_SHIFT      (1U)
#define VFIFO_SPI_CTLSETSPI_TXTHINTEN(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLSETSPI_TXTHINTEN_SHIFT)) & VFIFO_SPI_CTLSETSPI_TXTHINTEN_MASK)
#define VFIFO_SPI_CTLSETSPI_RXTIMEOUTINTEN_MASK  (0x10U)
#define VFIFO_SPI_CTLSETSPI_RXTIMEOUTINTEN_SHIFT (4U)
#define VFIFO_SPI_CTLSETSPI_RXTIMEOUTINTEN(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLSETSPI_RXTIMEOUTINTEN_SHIFT)) & VFIFO_SPI_CTLSETSPI_RXTIMEOUTINTEN_MASK)
#define VFIFO_SPI_CTLSETSPI_RXFLUSH_MASK         (0x100U)
#define VFIFO_SPI_CTLSETSPI_RXFLUSH_SHIFT        (8U)
#define VFIFO_SPI_CTLSETSPI_RXFLUSH(x)           (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLSETSPI_RXFLUSH_SHIFT)) & VFIFO_SPI_CTLSETSPI_RXFLUSH_MASK)
#define VFIFO_SPI_CTLSETSPI_TXFLUSH_MASK         (0x200U)
#define VFIFO_SPI_CTLSETSPI_TXFLUSH_SHIFT        (9U)
#define VFIFO_SPI_CTLSETSPI_TXFLUSH(x)           (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLSETSPI_TXFLUSH_SHIFT)) & VFIFO_SPI_CTLSETSPI_TXFLUSH_MASK)
/*! @} */

/* The count of VFIFO_SPI_CTLSETSPI */
#define VFIFO_SPI_CTLSETSPI_COUNT                (2U)

/*! @name SPI_CTLCLRSPI - SPI0 control clear register. Writing a 1 to any implemented bit position causes the corresponding bit in the related CTLSET register to be cleared. */
/*! @{ */
#define VFIFO_SPI_CTLCLRSPI_RXTHINTCLR_MASK      (0x1U)
#define VFIFO_SPI_CTLCLRSPI_RXTHINTCLR_SHIFT     (0U)
#define VFIFO_SPI_CTLCLRSPI_RXTHINTCLR(x)        (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLCLRSPI_RXTHINTCLR_SHIFT)) & VFIFO_SPI_CTLCLRSPI_RXTHINTCLR_MASK)
#define VFIFO_SPI_CTLCLRSPI_TXTHINTCLR_MASK      (0x2U)
#define VFIFO_SPI_CTLCLRSPI_TXTHINTCLR_SHIFT     (1U)
#define VFIFO_SPI_CTLCLRSPI_TXTHINTCLR(x)        (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLCLRSPI_TXTHINTCLR_SHIFT)) & VFIFO_SPI_CTLCLRSPI_TXTHINTCLR_MASK)
#define VFIFO_SPI_CTLCLRSPI_RXTIMEOUTINTCLR_MASK (0x10U)
#define VFIFO_SPI_CTLCLRSPI_RXTIMEOUTINTCLR_SHIFT (4U)
#define VFIFO_SPI_CTLCLRSPI_RXTIMEOUTINTCLR(x)   (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLCLRSPI_RXTIMEOUTINTCLR_SHIFT)) & VFIFO_SPI_CTLCLRSPI_RXTIMEOUTINTCLR_MASK)
#define VFIFO_SPI_CTLCLRSPI_RXFLUSHCLR_MASK      (0x100U)
#define VFIFO_SPI_CTLCLRSPI_RXFLUSHCLR_SHIFT     (8U)
#define VFIFO_SPI_CTLCLRSPI_RXFLUSHCLR(x)        (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLCLRSPI_RXFLUSHCLR_SHIFT)) & VFIFO_SPI_CTLCLRSPI_RXFLUSHCLR_MASK)
#define VFIFO_SPI_CTLCLRSPI_TXFLUSHCLR_MASK      (0x200U)
#define VFIFO_SPI_CTLCLRSPI_TXFLUSHCLR_SHIFT     (9U)
#define VFIFO_SPI_CTLCLRSPI_TXFLUSHCLR(x)        (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_CTLCLRSPI_TXFLUSHCLR_SHIFT)) & VFIFO_SPI_CTLCLRSPI_TXFLUSHCLR_MASK)
/*! @} */

/* The count of VFIFO_SPI_CTLCLRSPI */
#define VFIFO_SPI_CTLCLRSPI_COUNT                (2U)

/*! @name SPI_RXDATSPI - SPI0 received data. These registers are half word addressable. */
/*! @{ */
#define VFIFO_SPI_RXDATSPI_RXDAT_MASK            (0xFFFFU)
#define VFIFO_SPI_RXDATSPI_RXDAT_SHIFT           (0U)
#define VFIFO_SPI_RXDATSPI_RXDAT(x)              (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_RXDATSPI_RXDAT_SHIFT)) & VFIFO_SPI_RXDATSPI_RXDAT_MASK)
#define VFIFO_SPI_RXDATSPI_RXSSEL0_N_MASK        (0x10000U)
#define VFIFO_SPI_RXDATSPI_RXSSEL0_N_SHIFT       (16U)
#define VFIFO_SPI_RXDATSPI_RXSSEL0_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_RXDATSPI_RXSSEL0_N_SHIFT)) & VFIFO_SPI_RXDATSPI_RXSSEL0_N_MASK)
#define VFIFO_SPI_RXDATSPI_RXSSEL1_N_MASK        (0x20000U)
#define VFIFO_SPI_RXDATSPI_RXSSEL1_N_SHIFT       (17U)
#define VFIFO_SPI_RXDATSPI_RXSSEL1_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_RXDATSPI_RXSSEL1_N_SHIFT)) & VFIFO_SPI_RXDATSPI_RXSSEL1_N_MASK)
#define VFIFO_SPI_RXDATSPI_RXSSEL2_N_MASK        (0x40000U)
#define VFIFO_SPI_RXDATSPI_RXSSEL2_N_SHIFT       (18U)
#define VFIFO_SPI_RXDATSPI_RXSSEL2_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_RXDATSPI_RXSSEL2_N_SHIFT)) & VFIFO_SPI_RXDATSPI_RXSSEL2_N_MASK)
#define VFIFO_SPI_RXDATSPI_RXSSEL3_N_MASK        (0x80000U)
#define VFIFO_SPI_RXDATSPI_RXSSEL3_N_SHIFT       (19U)
#define VFIFO_SPI_RXDATSPI_RXSSEL3_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_RXDATSPI_RXSSEL3_N_SHIFT)) & VFIFO_SPI_RXDATSPI_RXSSEL3_N_MASK)
#define VFIFO_SPI_RXDATSPI_SOT_MASK              (0x100000U)
#define VFIFO_SPI_RXDATSPI_SOT_SHIFT             (20U)
#define VFIFO_SPI_RXDATSPI_SOT(x)                (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_RXDATSPI_SOT_SHIFT)) & VFIFO_SPI_RXDATSPI_SOT_MASK)
/*! @} */

/* The count of VFIFO_SPI_RXDATSPI */
#define VFIFO_SPI_RXDATSPI_COUNT                 (2U)

/*! @name SPI_TXDATSPI - SPI0 transmit data. These registers are half word addressable. */
/*! @{ */
#define VFIFO_SPI_TXDATSPI_TXDAT_MASK            (0xFFFFU)
#define VFIFO_SPI_TXDATSPI_TXDAT_SHIFT           (0U)
#define VFIFO_SPI_TXDATSPI_TXDAT(x)              (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_TXDAT_SHIFT)) & VFIFO_SPI_TXDATSPI_TXDAT_MASK)
#define VFIFO_SPI_TXDATSPI_TXSSEL0_N_MASK        (0x10000U)
#define VFIFO_SPI_TXDATSPI_TXSSEL0_N_SHIFT       (16U)
/*! TXSSEL0_N - Transmit Slave Select. This field asserts SSEL0 in master mode. The output on the
 *    pin is active LOW by default. The active state of the SSEL0 pin is configured by bits in the CFG
 *    register.
 *  0b0..Asserted. SSEL0 asserted.
 *  0b1..Not asserted. SSEL0 not asserted.
 */
#define VFIFO_SPI_TXDATSPI_TXSSEL0_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_TXSSEL0_N_SHIFT)) & VFIFO_SPI_TXDATSPI_TXSSEL0_N_MASK)
#define VFIFO_SPI_TXDATSPI_TXSSEL1_N_MASK        (0x20000U)
#define VFIFO_SPI_TXDATSPI_TXSSEL1_N_SHIFT       (17U)
/*! TXSSEL1_N - Transmit Slave Select. This field asserts SSEL1 in master mode. The output on the
 *    pin is active LOW by default. The active state of the SSEL1 pin is configured by bits in the CFG
 *    register.
 *  0b0..Asserted. SSEL1 asserted.
 *  0b1..Not asserted. SSEL1 not asserted.
 */
#define VFIFO_SPI_TXDATSPI_TXSSEL1_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_TXSSEL1_N_SHIFT)) & VFIFO_SPI_TXDATSPI_TXSSEL1_N_MASK)
#define VFIFO_SPI_TXDATSPI_TXSSEL2_N_MASK        (0x40000U)
#define VFIFO_SPI_TXDATSPI_TXSSEL2_N_SHIFT       (18U)
/*! TXSSEL2_N - Transmit Slave Select. This field asserts SSEL2 in master mode. The output on the
 *    pin is active LOW by default. The active state of the SSEL2 pin is configured by bits in the CFG
 *    register.
 *  0b0..Asserted. SSEL2 asserted.
 *  0b1..Not asserted. SSEL2 not asserted.
 */
#define VFIFO_SPI_TXDATSPI_TXSSEL2_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_TXSSEL2_N_SHIFT)) & VFIFO_SPI_TXDATSPI_TXSSEL2_N_MASK)
#define VFIFO_SPI_TXDATSPI_TXSSEL3_N_MASK        (0x80000U)
#define VFIFO_SPI_TXDATSPI_TXSSEL3_N_SHIFT       (19U)
/*! TXSSEL3_N - Transmit Slave Select. This field asserts SSEL3 in master mode. The output on the
 *    pin is active LOW by default. The active state of the SSEL3 pin is configured by bits in the CFG
 *    register.
 *  0b0..Asserted. SSEL3 asserted.
 *  0b1..Not asserted. SSEL3 not asserted.
 */
#define VFIFO_SPI_TXDATSPI_TXSSEL3_N(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_TXSSEL3_N_SHIFT)) & VFIFO_SPI_TXDATSPI_TXSSEL3_N_MASK)
#define VFIFO_SPI_TXDATSPI_EOT_MASK              (0x100000U)
#define VFIFO_SPI_TXDATSPI_EOT_SHIFT             (20U)
/*! EOT - End of Transfer. The asserted SSEL will be deasserted at the end of a transfer, and remain
 *    so for at least the time specified by the Transfer_delay value in the DLY register.
 *  0b0..Not deasserted. SSEL not deasserted. This piece of data is not treated as the end of a transfer. SSEL
 *       will not be deasserted at the end of this data.
 *  0b1..Deasserted. SSEL deasserted. This piece of data is treated as the end of a transfer. SSEL will be
 *       deasserted at the end of this piece of data.
 */
#define VFIFO_SPI_TXDATSPI_EOT(x)                (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_EOT_SHIFT)) & VFIFO_SPI_TXDATSPI_EOT_MASK)
#define VFIFO_SPI_TXDATSPI_EOF_MASK              (0x200000U)
#define VFIFO_SPI_TXDATSPI_EOF_SHIFT             (21U)
/*! EOF - End of Frame. Between frames, a delay may be inserted, as defined by the FRAME_DELAY value
 *    in the DLY register. The end of a frame may not be particularly meaningful if the FRAME_DELAY
 *    value = 0. This control can be used as part of the support for frame lengths greater than 16
 *    bits.
 *  0b0..Data not EOF. This piece of data transmitted is not treated as the end of a frame.
 *  0b1..Data EOF. This piece of data is treated as the end of a frame, causing the FRAME_DELAY time to be
 *       inserted before subsequent data is transmitted.
 */
#define VFIFO_SPI_TXDATSPI_EOF(x)                (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_EOF_SHIFT)) & VFIFO_SPI_TXDATSPI_EOF_MASK)
#define VFIFO_SPI_TXDATSPI_RXIGNORE_MASK         (0x400000U)
#define VFIFO_SPI_TXDATSPI_RXIGNORE_SHIFT        (22U)
/*! RXIGNORE - Receive Ignore. This allows data to be transmitted using the SPI without the need to
 *    read unneeded data from the receiver to simplify the transmit process and can be used with the
 *    DMA.
 *  0b0..Read received data. Received data must be read in order to allow transmission to progress. In slave mode,
 *       an overrun error will occur if received data is not read before new data is received.
 *  0b1..Ignore received data. Received data is ignored, allowing transmission without reading unneeded received
 *       data. No receiver flags are generated.
 */
#define VFIFO_SPI_TXDATSPI_RXIGNORE(x)           (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_RXIGNORE_SHIFT)) & VFIFO_SPI_TXDATSPI_RXIGNORE_MASK)
#define VFIFO_SPI_TXDATSPI_LEN_MASK              (0xF000000U)
#define VFIFO_SPI_TXDATSPI_LEN_SHIFT             (24U)
#define VFIFO_SPI_TXDATSPI_LEN(x)                (((uint32_t)(((uint32_t)(x)) << VFIFO_SPI_TXDATSPI_LEN_SHIFT)) & VFIFO_SPI_TXDATSPI_LEN_MASK)
/*! @} */

